MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GS502/mcu.h
extern volatile ADCMP1ENLBITS ADCMP1ENLbits __attribute__((__sfr__));

#define ADCMP1ENH ADCMP1ENH
extern volatile uint16_t ADCMP1ENH __attribute__((__sfr__));
typedef struct tagADCMP1ENHBITS {
  uint16_t :2;
  uint16_t CMPEN18:1;
  uint16_t CMPEN19:1;
  uint16_t CMPEN20:1;
  uint16_t CMPEN21:1;
} ADCMP1ENHBITS;
extern volatile ADCMP1ENHBITS ADCMP1ENHbits __attribute__((__sfr__));

#define ADCMP1LO ADCMP1LO
extern volatile uint16_t ADCMP1LO __attribute__((__sfr__));
#define ADCMP1HI ADCMP1HI
extern volatile uint16_t ADCMP1HI __attribute__((__sfr__));
#define ADFL0DAT ADFL0DAT
extern volatile uint16_t ADFL0DAT __attribute__((__sfr__));
#define ADFL0CON ADFL0CON
extern volatile uint16_t ADFL0CON __attribute__((__sfr__));
__extension__ typedef struct tagADFL0CONBITS {
  union {
    struct {
      uint16_t FLCHSEL:5;
      uint16_t :3;
      uint16_t RDY:1;
      uint16_t IE:1;
      uint16_t OVRSAM:3;
      uint16_t MODE:2;
      uint16_t FLEN:1;
    };
    struct {
      uint16_t FLCHSEL0:1;
      uint16_t FLCHSEL1:1;
      uint16_t FLCHSEL2:1;
      uint16_t FLCHSEL3:1;
      uint16_t FLCHSEL4:1;
      uint16_t :5;
      uint16_t OVRSAM0:1;
      uint16_t OVRSAM1:1;
      uint16_t OVRSAM2:1;
    };
  };
} ADFL0CONBITS;
extern volatile ADFL0CONBITS ADFL0CONbits __attribute__((__sfr__));

#define ADFL1DAT ADFL1DAT
extern volatile uint16_t ADFL1DAT __attribute__((__sfr__));
#define ADFL1CON ADFL1CON
extern volatile uint16_t ADFL1CON __attribute__((__sfr__));
__extension__ typedef struct tagADFL1CONBITS {
  union {
    struct {
      uint16_t FLCHSEL:5;
      uint16_t :3;
      uint16_t RDY:1;
      uint16_t IE:1;
      uint16_t OVRSAM:3;
      uint16_t MODE:2;
      uint16_t FLEN:1;
    };
    struct {
      uint16_t FLCHSEL0:1;
      uint16_t FLCHSEL1:1;
      uint16_t FLCHSEL2:1;
      uint16_t FLCHSEL3:1;
      uint16_t FLCHSEL4:1;
      uint16_t :5;
      uint16_t OVRSAM0:1;
      uint16_t OVRSAM1:1;
      uint16_t OVRSAM2:1;
    };
  };
} ADFL1CONBITS;
extern volatile ADFL1CONBITS ADFL1CONbits __attribute__((__sfr__));

#define ADTRIG0L ADTRIG0L
extern volatile uint16_t ADTRIG0L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG0LBITS {
  union {
    struct {
      uint16_t TRGSRC0:5;
      uint16_t :3;
      uint16_t TRGSRC1:5;
    };
    struct {
      uint16_t TRIGSRC00:1;
      uint16_t TRIGSRC01:1;
      uint16_t TRIGSRC02:1;
      uint16_t TRIGSRC03:1;
      uint16_t TRIGSRC04:1;
      uint16_t :3;
      uint16_t TRGSRC10:1;
      uint16_t TRGSRC11:1;
      uint16_t TRGSRC12:1;
      uint16_t TRGSRC13:1;
      uint16_t TRGSRC14:1;
    };
    struct {
      uint16_t TRGSRC00:1;
      uint16_t TRGSRC01:1;
      uint16_t TRGSRC02:1;
      uint16_t TRGSRC03:1;
      uint16_t TRGSRC04:1;
    };
  };
} ADTRIG0LBITS;
extern volatile ADTRIG0LBITS ADTRIG0Lbits __attribute__((__sfr__));

#define ADTRIG0H ADTRIG0H
extern volatile uint16_t ADTRIG0H __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG0HBITS {
  union {
    struct {
      uint16_t TRGSRC2:5;
      uint16_t :3;
      uint16_t TRGSRC3:5;
    };
    struct {
      uint16_t TRIGSRC20:1;
      uint16_t TRIGSRC21:1;
      uint16_t TRIGSRC22:1;
      uint16_t TRIGSRC23:1;
      uint16_t TRIGSRC24:1;
      uint16_t :3;
      uint16_t TRGSRC30:1;
      uint16_t TRGSRC31:1;
      uint16_t TRGSRC32:1;
      uint16_t TRGSRC33:1;
      uint16_t TRGSRC34:1;
    };
    struct {
      uint16_t TRGSRC20:1;
      uint16_t TRGSRC21:1;
      uint16_t TRGSRC22:1;
      uint16_t TRGSRC23:1;
      uint16_t TRGSRC24:1;
    };
  };
} ADTRIG0HBITS;
extern volatile ADTRIG0HBITS ADTRIG0Hbits __attribute__((__sfr__));

#define ADTRIG1L ADTRIG1L
extern volatile uint16_t ADTRIG1L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG1LBITS {
  union {
    struct {
      uint16_t TRGSRC4:5;
      uint16_t :3;
      uint16_t TRGSRC5:5;
    };
    struct {
      uint16_t TRIGSRC40:1;
      uint16_t TRIGSRC41:1;
      uint16_t TRIGSRC42:1;
      uint16_t TRIGSRC43:1;
      uint16_t TRIGSRC44:1;
      uint16_t :3;
      uint16_t TRGSRC50:1;
      uint16_t TRGSRC51:1;
      uint16_t TRGSRC52:1;
      uint16_t TRGSRC53:1;
      uint16_t TRGSRC54:1;
    };
    struct {
      uint16_t TRGSRC40:1;
      uint16_t TRGSRC41:1;
      uint16_t TRGSRC42:1;
      uint16_t TRGSRC43:1;
      uint16_t TRGSRC44:1;
    };
  };
} ADTRIG1LBITS;
extern volatile ADTRIG1LBITS ADTRIG1Lbits __attribute__((__sfr__));

#define ADTRIG1H ADTRIG1H
extern volatile uint16_t ADTRIG1H __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG1HBITS {
  union {
    struct {
      uint16_t TRGSRC6:5;
      uint16_t :3;
      uint16_t TRGSRC7:5;
    };
    struct {
      uint16_t TRIGSRC60:1;
      uint16_t TRIGSRC61:1;
      uint16_t TRIGSRC62:1;
      uint16_t TRIGSRC63:1;
      uint16_t TRIGSRC64:1;
      uint16_t :3;
      uint16_t TRGSRC70:1;
      uint16_t TRGSRC71:1;
      uint16_t TRGSRC72:1;
      uint16_t TRGSRC73:1;
      uint16_t TRGSRC74:1;
    };
    struct {
      uint16_t TRGSRC60:1;
      uint16_t TRGSRC61:1;
      uint16_t TRGSRC62:1;
      uint16_t TRGSRC63:1;
      uint16_t TRGSRC64:1;
    };
  };
} ADTRIG1HBITS;
extern volatile ADTRIG1HBITS ADTRIG1Hbits __attribute__((__sfr__));

#define ADTRIG4H ADTRIG4H
extern volatile uint16_t ADTRIG4H __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG4HBITS {
  union {
    struct {
      uint16_t TRGSRC18:5;
      uint16_t :3;
      uint16_t TRGSRC19:5;
    };
    struct {
      uint16_t TRIGSRC180:1;
      uint16_t TRIGSRC181:1;
      uint16_t TRIGSRC182:1;
      uint16_t TRIGSRC183:1;
      uint16_t TRIGSRC184:1;
      uint16_t :3;
      uint16_t TRGSRC190:1;
      uint16_t TRGSRC191:1;
      uint16_t TRGSRC192:1;
      uint16_t TRGSRC193:1;
      uint16_t TRGSRC194:1;
    };
    struct {
      uint16_t TRGSRC180:1;
      uint16_t TRGSRC181:1;
      uint16_t TRGSRC182:1;
      uint16_t TRGSRC183:1;
      uint16_t TRGSRC184:1;
    };
  };
} ADTRIG4HBITS;
extern volatile ADTRIG4HBITS ADTRIG4Hbits __attribute__((__sfr__));

#define ADTRIG5L ADTRIG5L
extern volatile uint16_t ADTRIG5L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG5LBITS {
  union {
    struct {
      uint16_t TRGSRC20:5;
      uint16_t :3;
      uint16_t TRGSRC21:5;
    };
    struct {
      uint16_t TRIGSRC200:1;
      uint16_t TRIGSRC201:1;
      uint16_t TRIGSRC202:1;
      uint16_t TRIGSRC203:1;
      uint16_t TRIGSRC204:1;
      uint16_t :3;
      uint16_t TRGSRC210:1;
      uint16_t TRGSRC211:1;
      uint16_t TRGSRC212:1;
      uint16_t TRGSRC213:1;
      uint16_t TRGSRC214:1;
    };
    struct {
      uint16_t TRGSRC200:1;
      uint16_t TRGSRC201:1;
      uint16_t TRGSRC202:1;
      uint16_t TRGSRC203:1;
      uint16_t TRGSRC204:1;
    };
  };
} ADTRIG5LBITS;
extern volatile ADTRIG5LBITS ADTRIG5Lbits __attribute__((__sfr__));

#define ADCMP0CON ADCMP0CON
extern volatile uint16_t ADCMP0CON __attribute__((__sfr__));
__extension__ typedef struct tagADCMP0CONBITS {
  union {
    struct {
      uint16_t LOLO:1;
      uint16_t LOHI:1;
      uint16_t HILO:1;
      uint16_t HIHI:1;
      uint16_t BTWN:1;
      uint16_t STAT:1;
      uint16_t IE:1;
      uint16_t CMPEN:1;
      uint16_t CHNL:5;
    };
    struct {
      uint16_t :8;
      uint16_t CHNL0:1;
      uint16_t CHNL1:1;
      uint16_t CHNL2:1;
      uint16_t CHNL3:1;
      uint16_t CHNL4:1;
    };
  };
} ADCMP0CONBITS;
extern volatile ADCMP0CONBITS ADCMP0CONbits __attribute__((__sfr__));

#define ADCMP1CON ADCMP1CON
extern volatile uint16_t ADCMP1CON __attribute__((__sfr__));
__extension__ typedef struct tagADCMP1CONBITS {
  union {
    struct {
      uint16_t LOLO:1;
      uint16_t LOHI:1;
      uint16_t HILO:1;
      uint16_t HIHI:1;
      uint16_t BTWN:1;
      uint16_t STAT:1;
      uint16_t IE:1;
      uint16_t CMPEN:1;
      uint16_t CHNL:5;
    };
    struct {
      uint16_t :8;
      uint16_t CHNL0:1;
      uint16_t CHNL1:1;
      uint16_t CHNL2:1;
      uint16_t CHNL3:1;
      uint16_t CHNL4:1;
    };
  };
} ADCMP1CONBITS;
extern volatile ADCMP1CONBITS ADCMP1CONbits __attribute__((__sfr__));

#define ADLVLTRGL ADLVLTRGL
extern volatile uint16_t ADLVLTRGL __attribute__((__sfr__));
typedef struct tagADLVLTRGLBITS {
  uint16_t LVLEN0:1;
  uint16_t LVLEN1:1;
  uint16_t LVLEN2:1;
  uint16_t LVLEN3:1;
  uint16_t LVLEN4:1;
  uint16_t LVLEN5:1;
  uint16_t LVLEN6:1;
  uint16_t LVLEN7:1;
} ADLVLTRGLBITS;
extern volatile ADLVLTRGLBITS ADLVLTRGLbits __attribute__((__sfr__));

