MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GS502/mcu.h
#define ADLVLTRGH ADLVLTRGH
extern volatile uint16_t ADLVLTRGH __attribute__((__sfr__));
typedef struct tagADLVLTRGHBITS {
  uint16_t :2;
  uint16_t LVLEN18:1;
  uint16_t LVLEN19:1;
  uint16_t LVLEN20:1;
  uint16_t LVLEN21:1;
} ADLVLTRGHBITS;
extern volatile ADLVLTRGHBITS ADLVLTRGHbits __attribute__((__sfr__));

#define ADCORE0L ADCORE0L
extern volatile uint16_t ADCORE0L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE0LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE0LBITS;
extern volatile ADCORE0LBITS ADCORE0Lbits __attribute__((__sfr__));

#define ADCORE0H ADCORE0H
extern volatile uint16_t ADCORE0H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE0HBITS {
  union {
    struct {
      uint16_t ADCS:7;
      uint16_t :1;
      uint16_t RES:2;
      uint16_t EISEL:3;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t :1;
      uint16_t RES0:1;
      uint16_t RES1:1;
      uint16_t EISEL0:1;
      uint16_t EISEL1:1;
      uint16_t EISEL2:1;
    };
  };
} ADCORE0HBITS;
extern volatile ADCORE0HBITS ADCORE0Hbits __attribute__((__sfr__));

#define ADCORE1L ADCORE1L
extern volatile uint16_t ADCORE1L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE1LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE1LBITS;
extern volatile ADCORE1LBITS ADCORE1Lbits __attribute__((__sfr__));

#define ADCORE1H ADCORE1H
extern volatile uint16_t ADCORE1H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE1HBITS {
  union {
    struct {
      uint16_t ADCS:7;
      uint16_t :1;
      uint16_t RES:2;
      uint16_t EISEL:3;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t :1;
      uint16_t RES0:1;
      uint16_t RES1:1;
      uint16_t EISEL0:1;
      uint16_t EISEL1:1;
      uint16_t EISEL2:1;
    };
  };
} ADCORE1HBITS;
extern volatile ADCORE1HBITS ADCORE1Hbits __attribute__((__sfr__));

#define ADCORE2L ADCORE2L
extern volatile uint16_t ADCORE2L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE2LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE2LBITS;
extern volatile ADCORE2LBITS ADCORE2Lbits __attribute__((__sfr__));

#define ADCORE2H ADCORE2H
extern volatile uint16_t ADCORE2H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE2HBITS {
  union {
    struct {
      uint16_t ADCS:7;
      uint16_t :1;
      uint16_t RES:2;
      uint16_t EISEL:3;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t :1;
      uint16_t RES0:1;
      uint16_t RES1:1;
      uint16_t EISEL0:1;
      uint16_t EISEL1:1;
      uint16_t EISEL2:1;
    };
  };
} ADCORE2HBITS;
extern volatile ADCORE2HBITS ADCORE2Hbits __attribute__((__sfr__));

#define ADCORE3L ADCORE3L
extern volatile uint16_t ADCORE3L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE3LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE3LBITS;
extern volatile ADCORE3LBITS ADCORE3Lbits __attribute__((__sfr__));

#define ADCORE3H ADCORE3H
extern volatile uint16_t ADCORE3H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE3HBITS {
  union {
    struct {
      uint16_t ADCS:7;
      uint16_t :1;
      uint16_t RES:2;
      uint16_t EISEL:3;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t :1;
      uint16_t RES0:1;
      uint16_t RES1:1;
      uint16_t EISEL0:1;
      uint16_t EISEL1:1;
      uint16_t EISEL2:1;
    };
  };
} ADCORE3HBITS;
extern volatile ADCORE3HBITS ADCORE3Hbits __attribute__((__sfr__));

#define ADEIEL ADEIEL
extern volatile uint16_t ADEIEL __attribute__((__sfr__));
typedef struct tagADEIELBITS {
  uint16_t EIEN0:1;
  uint16_t EIEN1:1;
  uint16_t EIEN2:1;
  uint16_t EIEN3:1;
  uint16_t EIEN4:1;
  uint16_t EIEN5:1;
  uint16_t EIEN6:1;
  uint16_t EIEN7:1;
} ADEIELBITS;
extern volatile ADEIELBITS ADEIELbits __attribute__((__sfr__));

#define ADEIEH ADEIEH
extern volatile uint16_t ADEIEH __attribute__((__sfr__));
typedef struct tagADEIEHBITS {
  uint16_t :2;
  uint16_t EIEN18:1;
  uint16_t EIEN19:1;
  uint16_t EIEN20:1;
  uint16_t EIEN21:1;
} ADEIEHBITS;
extern volatile ADEIEHBITS ADEIEHbits __attribute__((__sfr__));

#define ADEISTATL ADEISTATL
extern volatile uint16_t ADEISTATL __attribute__((__sfr__));
typedef struct tagADEISTATLBITS {
  uint16_t EISTAT0:1;
  uint16_t EISTAT1:1;
  uint16_t EISTAT2:1;
  uint16_t EISTAT3:1;
  uint16_t EISTAT4:1;
  uint16_t EISTAT5:1;
  uint16_t EISTAT6:1;
  uint16_t EISTAT7:1;
} ADEISTATLBITS;
