MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GS502/mcu.h
#define _ADCON4H_C1CHS1_POSITION                 0x00000003
#define _ADCON4H_C1CHS1_MASK                     0x00000008
#define _ADCON4H_C1CHS1_LENGTH                   0x00000001

#define _ADCON4H_C2CHS0_POSITION                 0x00000004
#define _ADCON4H_C2CHS0_MASK                     0x00000010
#define _ADCON4H_C2CHS0_LENGTH                   0x00000001

#define _ADCON4H_C2CHS1_POSITION                 0x00000005
#define _ADCON4H_C2CHS1_MASK                     0x00000020
#define _ADCON4H_C2CHS1_LENGTH                   0x00000001

#define _ADCON4H_C3CHS0_POSITION                 0x00000006
#define _ADCON4H_C3CHS0_MASK                     0x00000040
#define _ADCON4H_C3CHS0_LENGTH                   0x00000001

#define _ADCON4H_C3CHS1_POSITION                 0x00000007
#define _ADCON4H_C3CHS1_MASK                     0x00000080
#define _ADCON4H_C3CHS1_LENGTH                   0x00000001

#define _ADMOD0L_SIGN0_POSITION                  0x00000000
#define _ADMOD0L_SIGN0_MASK                      0x00000001
#define _ADMOD0L_SIGN0_LENGTH                    0x00000001

#define _ADMOD0L_DIFF0_POSITION                  0x00000001
#define _ADMOD0L_DIFF0_MASK                      0x00000002
#define _ADMOD0L_DIFF0_LENGTH                    0x00000001

#define _ADMOD0L_SIGN1_POSITION                  0x00000002
#define _ADMOD0L_SIGN1_MASK                      0x00000004
#define _ADMOD0L_SIGN1_LENGTH                    0x00000001

#define _ADMOD0L_DIFF1_POSITION                  0x00000003
#define _ADMOD0L_DIFF1_MASK                      0x00000008
#define _ADMOD0L_DIFF1_LENGTH                    0x00000001

#define _ADMOD0L_SIGN2_POSITION                  0x00000004
#define _ADMOD0L_SIGN2_MASK                      0x00000010
#define _ADMOD0L_SIGN2_LENGTH                    0x00000001

#define _ADMOD0L_DIFF2_POSITION                  0x00000005
#define _ADMOD0L_DIFF2_MASK                      0x00000020
#define _ADMOD0L_DIFF2_LENGTH                    0x00000001

#define _ADMOD0L_SIGN3_POSITION                  0x00000006
#define _ADMOD0L_SIGN3_MASK                      0x00000040
#define _ADMOD0L_SIGN3_LENGTH                    0x00000001

#define _ADMOD0L_DIFF3_POSITION                  0x00000007
#define _ADMOD0L_DIFF3_MASK                      0x00000080
#define _ADMOD0L_DIFF3_LENGTH                    0x00000001

#define _ADMOD0L_SIGN4_POSITION                  0x00000008
#define _ADMOD0L_SIGN4_MASK                      0x00000100
#define _ADMOD0L_SIGN4_LENGTH                    0x00000001

#define _ADMOD0L_DIFF4_POSITION                  0x00000009
#define _ADMOD0L_DIFF4_MASK                      0x00000200
#define _ADMOD0L_DIFF4_LENGTH                    0x00000001

#define _ADMOD0L_SIGN5_POSITION                  0x0000000A
#define _ADMOD0L_SIGN5_MASK                      0x00000400
#define _ADMOD0L_SIGN5_LENGTH                    0x00000001

#define _ADMOD0L_DIFF5_POSITION                  0x0000000B
#define _ADMOD0L_DIFF5_MASK                      0x00000800
#define _ADMOD0L_DIFF5_LENGTH                    0x00000001

#define _ADMOD0L_SIGN6_POSITION                  0x0000000C
#define _ADMOD0L_SIGN6_MASK                      0x00001000
#define _ADMOD0L_SIGN6_LENGTH                    0x00000001

#define _ADMOD0L_DIFF6_POSITION                  0x0000000D
#define _ADMOD0L_DIFF6_MASK                      0x00002000
#define _ADMOD0L_DIFF6_LENGTH                    0x00000001

#define _ADMOD0L_SIGN7_POSITION                  0x0000000E
#define _ADMOD0L_SIGN7_MASK                      0x00004000
#define _ADMOD0L_SIGN7_LENGTH                    0x00000001

#define _ADMOD0L_DIFF7_POSITION                  0x0000000F
#define _ADMOD0L_DIFF7_MASK                      0x00008000
#define _ADMOD0L_DIFF7_LENGTH                    0x00000001

#define _ADMOD1L_SIGN18_POSITION                 0x00000004
#define _ADMOD1L_SIGN18_MASK                     0x00000010
#define _ADMOD1L_SIGN18_LENGTH                   0x00000001

#define _ADMOD1L_DIFF18_POSITION                 0x00000005
#define _ADMOD1L_DIFF18_MASK                     0x00000020
#define _ADMOD1L_DIFF18_LENGTH                   0x00000001

#define _ADMOD1L_SIGN19_POSITION                 0x00000006
#define _ADMOD1L_SIGN19_MASK                     0x00000040
#define _ADMOD1L_SIGN19_LENGTH                   0x00000001

#define _ADMOD1L_DIFF19_POSITION                 0x00000007
#define _ADMOD1L_DIFF19_MASK                     0x00000080
#define _ADMOD1L_DIFF19_LENGTH                   0x00000001

#define _ADMOD1L_SIGN20_POSITION                 0x00000008
#define _ADMOD1L_SIGN20_MASK                     0x00000100
#define _ADMOD1L_SIGN20_LENGTH                   0x00000001

#define _ADMOD1L_DIFF20_POSITION                 0x00000009
#define _ADMOD1L_DIFF20_MASK                     0x00000200
#define _ADMOD1L_DIFF20_LENGTH                   0x00000001

#define _ADMOD1L_SIGN21_POSITION                 0x0000000A
#define _ADMOD1L_SIGN21_MASK                     0x00000400
#define _ADMOD1L_SIGN21_LENGTH                   0x00000001

#define _ADMOD1L_DIFF21_POSITION                 0x0000000B
#define _ADMOD1L_DIFF21_MASK                     0x00000800
#define _ADMOD1L_DIFF21_LENGTH                   0x00000001

#define _ADIEL_IE0_POSITION                      0x00000000
#define _ADIEL_IE0_MASK                          0x00000001
#define _ADIEL_IE0_LENGTH                        0x00000001

#define _ADIEL_IE1_POSITION                      0x00000001
#define _ADIEL_IE1_MASK                          0x00000002
#define _ADIEL_IE1_LENGTH                        0x00000001

#define _ADIEL_IE2_POSITION                      0x00000002
#define _ADIEL_IE2_MASK                          0x00000004
#define _ADIEL_IE2_LENGTH                        0x00000001

#define _ADIEL_IE3_POSITION                      0x00000003
#define _ADIEL_IE3_MASK                          0x00000008
#define _ADIEL_IE3_LENGTH                        0x00000001

#define _ADIEL_IE4_POSITION                      0x00000004
#define _ADIEL_IE4_MASK                          0x00000010
#define _ADIEL_IE4_LENGTH                        0x00000001

#define _ADIEL_IE5_POSITION                      0x00000005
#define _ADIEL_IE5_MASK                          0x00000020
#define _ADIEL_IE5_LENGTH                        0x00000001

