MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GS502/mcu.h
#define _ADTRIG1L_TRGSRC50_POSITION              0x00000008
#define _ADTRIG1L_TRGSRC50_MASK                  0x00000100
#define _ADTRIG1L_TRGSRC50_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC51_POSITION              0x00000009
#define _ADTRIG1L_TRGSRC51_MASK                  0x00000200
#define _ADTRIG1L_TRGSRC51_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC52_POSITION              0x0000000A
#define _ADTRIG1L_TRGSRC52_MASK                  0x00000400
#define _ADTRIG1L_TRGSRC52_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC53_POSITION              0x0000000B
#define _ADTRIG1L_TRGSRC53_MASK                  0x00000800
#define _ADTRIG1L_TRGSRC53_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC54_POSITION              0x0000000C
#define _ADTRIG1L_TRGSRC54_MASK                  0x00001000
#define _ADTRIG1L_TRGSRC54_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC40_POSITION              0x00000000
#define _ADTRIG1L_TRGSRC40_MASK                  0x00000001
#define _ADTRIG1L_TRGSRC40_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC41_POSITION              0x00000001
#define _ADTRIG1L_TRGSRC41_MASK                  0x00000002
#define _ADTRIG1L_TRGSRC41_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC42_POSITION              0x00000002
#define _ADTRIG1L_TRGSRC42_MASK                  0x00000004
#define _ADTRIG1L_TRGSRC42_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC43_POSITION              0x00000003
#define _ADTRIG1L_TRGSRC43_MASK                  0x00000008
#define _ADTRIG1L_TRGSRC43_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC44_POSITION              0x00000004
#define _ADTRIG1L_TRGSRC44_MASK                  0x00000010
#define _ADTRIG1L_TRGSRC44_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC6_POSITION               0x00000000
#define _ADTRIG1H_TRGSRC6_MASK                   0x0000001F
#define _ADTRIG1H_TRGSRC6_LENGTH                 0x00000005

#define _ADTRIG1H_TRGSRC7_POSITION               0x00000008
#define _ADTRIG1H_TRGSRC7_MASK                   0x00001F00
#define _ADTRIG1H_TRGSRC7_LENGTH                 0x00000005

#define _ADTRIG1H_TRIGSRC60_POSITION             0x00000000
#define _ADTRIG1H_TRIGSRC60_MASK                 0x00000001
#define _ADTRIG1H_TRIGSRC60_LENGTH               0x00000001

#define _ADTRIG1H_TRIGSRC61_POSITION             0x00000001
#define _ADTRIG1H_TRIGSRC61_MASK                 0x00000002
#define _ADTRIG1H_TRIGSRC61_LENGTH               0x00000001

#define _ADTRIG1H_TRIGSRC62_POSITION             0x00000002
#define _ADTRIG1H_TRIGSRC62_MASK                 0x00000004
#define _ADTRIG1H_TRIGSRC62_LENGTH               0x00000001

#define _ADTRIG1H_TRIGSRC63_POSITION             0x00000003
#define _ADTRIG1H_TRIGSRC63_MASK                 0x00000008
#define _ADTRIG1H_TRIGSRC63_LENGTH               0x00000001

#define _ADTRIG1H_TRIGSRC64_POSITION             0x00000004
#define _ADTRIG1H_TRIGSRC64_MASK                 0x00000010
#define _ADTRIG1H_TRIGSRC64_LENGTH               0x00000001

#define _ADTRIG1H_TRGSRC70_POSITION              0x00000008
#define _ADTRIG1H_TRGSRC70_MASK                  0x00000100
#define _ADTRIG1H_TRGSRC70_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC71_POSITION              0x00000009
#define _ADTRIG1H_TRGSRC71_MASK                  0x00000200
#define _ADTRIG1H_TRGSRC71_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC72_POSITION              0x0000000A
#define _ADTRIG1H_TRGSRC72_MASK                  0x00000400
#define _ADTRIG1H_TRGSRC72_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC73_POSITION              0x0000000B
#define _ADTRIG1H_TRGSRC73_MASK                  0x00000800
#define _ADTRIG1H_TRGSRC73_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC74_POSITION              0x0000000C
#define _ADTRIG1H_TRGSRC74_MASK                  0x00001000
#define _ADTRIG1H_TRGSRC74_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC60_POSITION              0x00000000
#define _ADTRIG1H_TRGSRC60_MASK                  0x00000001
#define _ADTRIG1H_TRGSRC60_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC61_POSITION              0x00000001
#define _ADTRIG1H_TRGSRC61_MASK                  0x00000002
#define _ADTRIG1H_TRGSRC61_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC62_POSITION              0x00000002
#define _ADTRIG1H_TRGSRC62_MASK                  0x00000004
#define _ADTRIG1H_TRGSRC62_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC63_POSITION              0x00000003
#define _ADTRIG1H_TRGSRC63_MASK                  0x00000008
#define _ADTRIG1H_TRGSRC63_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC64_POSITION              0x00000004
#define _ADTRIG1H_TRGSRC64_MASK                  0x00000010
#define _ADTRIG1H_TRGSRC64_LENGTH                0x00000001

#define _ADTRIG4H_TRGSRC18_POSITION              0x00000000
#define _ADTRIG4H_TRGSRC18_MASK                  0x0000001F
#define _ADTRIG4H_TRGSRC18_LENGTH                0x00000005

#define _ADTRIG4H_TRGSRC19_POSITION              0x00000008
#define _ADTRIG4H_TRGSRC19_MASK                  0x00001F00
#define _ADTRIG4H_TRGSRC19_LENGTH                0x00000005

#define _ADTRIG4H_TRIGSRC180_POSITION            0x00000000
#define _ADTRIG4H_TRIGSRC180_MASK                0x00000001
#define _ADTRIG4H_TRIGSRC180_LENGTH              0x00000001

#define _ADTRIG4H_TRIGSRC181_POSITION            0x00000001
#define _ADTRIG4H_TRIGSRC181_MASK                0x00000002
#define _ADTRIG4H_TRIGSRC181_LENGTH              0x00000001

#define _ADTRIG4H_TRIGSRC182_POSITION            0x00000002
#define _ADTRIG4H_TRIGSRC182_MASK                0x00000004
#define _ADTRIG4H_TRIGSRC182_LENGTH              0x00000001

#define _ADTRIG4H_TRIGSRC183_POSITION            0x00000003
#define _ADTRIG4H_TRIGSRC183_MASK                0x00000008
#define _ADTRIG4H_TRIGSRC183_LENGTH              0x00000001

#define _ADTRIG4H_TRIGSRC184_POSITION            0x00000004
#define _ADTRIG4H_TRIGSRC184_MASK                0x00000010
#define _ADTRIG4H_TRIGSRC184_LENGTH              0x00000001

#define _ADTRIG4H_TRGSRC190_POSITION             0x00000008
#define _ADTRIG4H_TRGSRC190_MASK                 0x00000100
#define _ADTRIG4H_TRGSRC190_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC191_POSITION             0x00000009
#define _ADTRIG4H_TRGSRC191_MASK                 0x00000200
#define _ADTRIG4H_TRGSRC191_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC192_POSITION             0x0000000A
#define _ADTRIG4H_TRGSRC192_MASK                 0x00000400
#define _ADTRIG4H_TRGSRC192_LENGTH               0x00000001

