MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GS502/mcu.h
#define _RPINR20_SCK1INR7_POSITION               0x0000000F
#define _RPINR20_SCK1INR7_MASK                   0x00008000
#define _RPINR20_SCK1INR7_LENGTH                 0x00000001

#define _RPINR21_SS1R_POSITION                   0x00000000
#define _RPINR21_SS1R_MASK                       0x000000FF
#define _RPINR21_SS1R_LENGTH                     0x00000008

#define _RPINR21_SS1R0_POSITION                  0x00000000
#define _RPINR21_SS1R0_MASK                      0x00000001
#define _RPINR21_SS1R0_LENGTH                    0x00000001

#define _RPINR21_SS1R1_POSITION                  0x00000001
#define _RPINR21_SS1R1_MASK                      0x00000002
#define _RPINR21_SS1R1_LENGTH                    0x00000001

#define _RPINR21_SS1R2_POSITION                  0x00000002
#define _RPINR21_SS1R2_MASK                      0x00000004
#define _RPINR21_SS1R2_LENGTH                    0x00000001

#define _RPINR21_SS1R3_POSITION                  0x00000003
#define _RPINR21_SS1R3_MASK                      0x00000008
#define _RPINR21_SS1R3_LENGTH                    0x00000001

#define _RPINR21_SS1R4_POSITION                  0x00000004
#define _RPINR21_SS1R4_MASK                      0x00000010
#define _RPINR21_SS1R4_LENGTH                    0x00000001

#define _RPINR21_SS1R5_POSITION                  0x00000005
#define _RPINR21_SS1R5_MASK                      0x00000020
#define _RPINR21_SS1R5_LENGTH                    0x00000001

#define _RPINR21_SS1R6_POSITION                  0x00000006
#define _RPINR21_SS1R6_MASK                      0x00000040
#define _RPINR21_SS1R6_LENGTH                    0x00000001

#define _RPINR21_SS1R7_POSITION                  0x00000007
#define _RPINR21_SS1R7_MASK                      0x00000080
#define _RPINR21_SS1R7_LENGTH                    0x00000001

#define _RPINR22_SDI2R_POSITION                  0x00000000
#define _RPINR22_SDI2R_MASK                      0x000000FF
#define _RPINR22_SDI2R_LENGTH                    0x00000008

#define _RPINR22_SCK2INR_POSITION                0x00000008
#define _RPINR22_SCK2INR_MASK                    0x0000FF00
#define _RPINR22_SCK2INR_LENGTH                  0x00000008

#define _RPINR22_SDI2R0_POSITION                 0x00000000
#define _RPINR22_SDI2R0_MASK                     0x00000001
#define _RPINR22_SDI2R0_LENGTH                   0x00000001

#define _RPINR22_SDI2R1_POSITION                 0x00000001
#define _RPINR22_SDI2R1_MASK                     0x00000002
#define _RPINR22_SDI2R1_LENGTH                   0x00000001

#define _RPINR22_SDI2R2_POSITION                 0x00000002
#define _RPINR22_SDI2R2_MASK                     0x00000004
#define _RPINR22_SDI2R2_LENGTH                   0x00000001

#define _RPINR22_SDI2R3_POSITION                 0x00000003
#define _RPINR22_SDI2R3_MASK                     0x00000008
#define _RPINR22_SDI2R3_LENGTH                   0x00000001

#define _RPINR22_SDI2R4_POSITION                 0x00000004
#define _RPINR22_SDI2R4_MASK                     0x00000010
#define _RPINR22_SDI2R4_LENGTH                   0x00000001

#define _RPINR22_SDI2R5_POSITION                 0x00000005
#define _RPINR22_SDI2R5_MASK                     0x00000020
#define _RPINR22_SDI2R5_LENGTH                   0x00000001

#define _RPINR22_SDI2R6_POSITION                 0x00000006
#define _RPINR22_SDI2R6_MASK                     0x00000040
#define _RPINR22_SDI2R6_LENGTH                   0x00000001

#define _RPINR22_SDI2R7_POSITION                 0x00000007
#define _RPINR22_SDI2R7_MASK                     0x00000080
#define _RPINR22_SDI2R7_LENGTH                   0x00000001

#define _RPINR22_SCK2INR0_POSITION               0x00000008
#define _RPINR22_SCK2INR0_MASK                   0x00000100
#define _RPINR22_SCK2INR0_LENGTH                 0x00000001

#define _RPINR22_SCK2INR1_POSITION               0x00000009
#define _RPINR22_SCK2INR1_MASK                   0x00000200
#define _RPINR22_SCK2INR1_LENGTH                 0x00000001

#define _RPINR22_SCK2INR2_POSITION               0x0000000A
#define _RPINR22_SCK2INR2_MASK                   0x00000400
#define _RPINR22_SCK2INR2_LENGTH                 0x00000001

#define _RPINR22_SCK2INR3_POSITION               0x0000000B
#define _RPINR22_SCK2INR3_MASK                   0x00000800
#define _RPINR22_SCK2INR3_LENGTH                 0x00000001

#define _RPINR22_SCK2INR4_POSITION               0x0000000C
#define _RPINR22_SCK2INR4_MASK                   0x00001000
#define _RPINR22_SCK2INR4_LENGTH                 0x00000001

#define _RPINR22_SCK2INR5_POSITION               0x0000000D
#define _RPINR22_SCK2INR5_MASK                   0x00002000
#define _RPINR22_SCK2INR5_LENGTH                 0x00000001

#define _RPINR22_SCK2INR6_POSITION               0x0000000E
#define _RPINR22_SCK2INR6_MASK                   0x00004000
#define _RPINR22_SCK2INR6_LENGTH                 0x00000001

#define _RPINR22_SCK2INR7_POSITION               0x0000000F
#define _RPINR22_SCK2INR7_MASK                   0x00008000
#define _RPINR22_SCK2INR7_LENGTH                 0x00000001

#define _RPINR23_SS2R_POSITION                   0x00000000
#define _RPINR23_SS2R_MASK                       0x000000FF
#define _RPINR23_SS2R_LENGTH                     0x00000008

#define _RPINR23_SS2R0_POSITION                  0x00000000
#define _RPINR23_SS2R0_MASK                      0x00000001
#define _RPINR23_SS2R0_LENGTH                    0x00000001

#define _RPINR23_SS2R1_POSITION                  0x00000001
#define _RPINR23_SS2R1_MASK                      0x00000002
#define _RPINR23_SS2R1_LENGTH                    0x00000001

#define _RPINR23_SS2R2_POSITION                  0x00000002
#define _RPINR23_SS2R2_MASK                      0x00000004
#define _RPINR23_SS2R2_LENGTH                    0x00000001

#define _RPINR23_SS2R3_POSITION                  0x00000003
#define _RPINR23_SS2R3_MASK                      0x00000008
#define _RPINR23_SS2R3_LENGTH                    0x00000001

#define _RPINR23_SS2R4_POSITION                  0x00000004
#define _RPINR23_SS2R4_MASK                      0x00000010
#define _RPINR23_SS2R4_LENGTH                    0x00000001

#define _RPINR23_SS2R5_POSITION                  0x00000005
#define _RPINR23_SS2R5_MASK                      0x00000020
#define _RPINR23_SS2R5_LENGTH                    0x00000001

